Repository: arotcarena/Cocktailissimo
Catalog: translations/validators.*.xlf
Languages: es, it

# assert.logged
source: Log in to create an address
es: Conéctese para crear una dirección
it: Accedi per creare un indirizzo.

# assert.choice
source: Please choose between the differents options
es: Elija entre las distintas opciones
it: Scegli tra le opzioni proposte

# assert.maxLength
source: {{ limit }} caracters maximum
es: {{ limit }} caracteres maximo
it: {{ limit }} caratteri massimo

# assert.notBlank.firstName
source: First name is required
es: El nombre es obligatorio
it: Il nome è obbligatorio

# assert.notBlank.lastName
source: Last name is required
es: El apellido es obligatorio
it: Il cognome è obbligatorio

# assert.notBlank.streetAddress
source: Address is required
es: La dirección es obligatoria
it: L'indirizzo è obligatorio

# assert.notBlank.city
source: City is required
es: La ciudad es obligatoria
it: La città è obbligatoria

# assert.notBlank.postcode
source: Postal code is required
es: El código postal es obligatorio
it: Il codice postale è obbligatorio

# assert.notBlank.country
source: Country is required
es: El país es Obligatorio
it: Il paese è obbligatorio

# assert.notBlank.socialAddress
source: Registered office address is required
es: La dirección de la sede social es obligatoria
it: L'indirizzo della sede legale è obbligatorio

# assert.notBlank.senderAddress
source: Shipping address is required
es: La dirección de envío es obligatoria
it: L'indirizzo di spedizione è obbligatorio

# assert.email
source: Invalid email address
es: Dirección de correo electrónico no válida
it: Indirizzo email non valido

# assert.notBlank.email
source: Email address is required
es: El correo electrónico es obligatorio
it: L'indirizzo email è obbligatorio

# assert.notBlank.message
source: Message is required
es: El mensaje es obligatorio
it: Il nome è obbligatorio

# assert.notBlank.fullName
source: Name is required
es: El nombre es obligatorio
it: Il messaggio è obbligatorio.

# assert.range.rate
source: Rate between 1 And 5
es: Elija una nota entre 1 y 5
it: Scegli una valutazione da 1 a 5.

# assert.notBlank.password
source: Password is required
es: La contraseña es obligatoria
it: La password è obbligatoria

# assert.notBlank.oldPassword
source: Old password is required
es: La contraseña anterior es obligatoria
it: La vecchia password è obbligatoria

# assert.minLength
source: {{ limit }} caracters at least
es: {{ limit }} caracteres mínimo
it: {{ limit }} caratteri richiesto

# assert.samePasswords
source: The two passwords are different
es: Las dos contraseñas son distintas
it: Le due password non corrispondono

# assert.notBlank.passwordConfirm
source: Please confirm your password
es: La confirmación de su contraseña es obligatoria
it: La conferma della password è obbligatoria

# assert.notUnique.email
source: This email address already exists
es: La dirección de correo electrónico ya está utilizada
it: Questo indirizzo email corrisponde a un account già esistente

# assert.true.agreeTerms
source: Please agree with the terms and conditions of use
es: Tiene que aceptar las condiciones generales de uso
it: Devi accettare i termini e le condizioni generali
